grevaillot/svd_tools/headers/STM32F7x7/dsi.h
#pragma once 

/* --- DSI: DSI Host ------------------------------------------------ */

/** @defgroup dsi_registers DSI Host Register
@{*/

/** DSI_DSI_VR DSI Host Version Register **/
#define DSI_DSI_VR			MMIO32(DSI_BASE + 0x00)
/** DSI_DSI_CR DSI Host Control Register **/
#define DSI_DSI_CR			MMIO32(DSI_BASE + 0x04)
/** DSI_DSI_CCR DSI HOST Clock Control Register **/
#define DSI_DSI_CCR			MMIO32(DSI_BASE + 0x08)
/** DSI_DSI_LVCIDR DSI Host LTDC VCID Register **/
#define DSI_DSI_LVCIDR			MMIO32(DSI_BASE + 0x0c)
/** DSI_DSI_LCOLCR DSI Host LTDC Color Coding Register **/
#define DSI_DSI_LCOLCR			MMIO32(DSI_BASE + 0x10)
/** DSI_DSI_LPCR DSI Host LTDC Polarity Configuration Register **/
#define DSI_DSI_LPCR			MMIO32(DSI_BASE + 0x14)
/** DSI_DSI_LPMCR DSI Host Low-Power mode Configuration Register **/
#define DSI_DSI_LPMCR			MMIO32(DSI_BASE + 0x18)
/** DSI_DSI_PCR DSI Host Protocol Configuration Register **/
#define DSI_DSI_PCR			MMIO32(DSI_BASE + 0x2c)
/** DSI_DSI_GVCIDR DSI Host Generic VCID Register **/
#define DSI_DSI_GVCIDR			MMIO32(DSI_BASE + 0x30)
/** DSI_DSI_MCR DSI Host mode Configuration Register **/
#define DSI_DSI_MCR			MMIO32(DSI_BASE + 0x34)
/** DSI_DSI_VMCR DSI Host Video mode Configuration Register **/
#define DSI_DSI_VMCR			MMIO32(DSI_BASE + 0x38)
/** DSI_DSI_VPCR DSI Host Video Packet Configuration Register **/
#define DSI_DSI_VPCR			MMIO32(DSI_BASE + 0x3c)
/** DSI_DSI_VCCR DSI Host Video Chunks Configuration Register **/
#define DSI_DSI_VCCR			MMIO32(DSI_BASE + 0x40)
/** DSI_DSI_VNPCR DSI Host Video Null Packet Configuration Register **/
#define DSI_DSI_VNPCR			MMIO32(DSI_BASE + 0x44)
/** DSI_DSI_VHSACR DSI Host Video HSA Configuration Register **/
#define DSI_DSI_VHSACR			MMIO32(DSI_BASE + 0x48)
/** DSI_DSI_VHBPCR DSI Host Video HBP Configuration Register **/
#define DSI_DSI_VHBPCR			MMIO32(DSI_BASE + 0x4c)
/** DSI_DSI_VLCR DSI Host Video Line Configuration Register **/
#define DSI_DSI_VLCR			MMIO32(DSI_BASE + 0x50)
/** DSI_DSI_VVSACR DSI Host Video VSA Configuration Register **/
#define DSI_DSI_VVSACR			MMIO32(DSI_BASE + 0x54)
/** DSI_DSI_VVBPCR DSI Host Video VBP Configuration Register **/
#define DSI_DSI_VVBPCR			MMIO32(DSI_BASE + 0x58)
/** DSI_DSI_VVFPCR DSI Host Video VFP Configuration Register **/
#define DSI_DSI_VVFPCR			MMIO32(DSI_BASE + 0x5c)
/** DSI_DSI_VVACR DSI Host Video VA Configuration Register **/
#define DSI_DSI_VVACR			MMIO32(DSI_BASE + 0x60)
/** DSI_DSI_LCCR DSI Host LTDC Command Configuration Register **/
#define DSI_DSI_LCCR			MMIO32(DSI_BASE + 0x64)
/** DSI_DSI_CMCR DSI Host Command mode Configuration Register **/
#define DSI_DSI_CMCR			MMIO32(DSI_BASE + 0x68)
/** DSI_DSI_GHCR DSI Host Generic Header Configuration Register **/
#define DSI_DSI_GHCR			MMIO32(DSI_BASE + 0x6c)
/** DSI_DSI_GPDR DSI Host Generic Payload Data Register **/
#define DSI_DSI_GPDR			MMIO32(DSI_BASE + 0x70)
/** DSI_DSI_GPSR DSI Host Generic Packet Status Register **/
#define DSI_DSI_GPSR			MMIO32(DSI_BASE + 0x74)
/** DSI_DSI_TCCR0 DSI Host Timeout Counter Configuration Register 0 **/
#define DSI_DSI_TCCR0			MMIO32(DSI_BASE + 0x78)
/** DSI_DSI_TCCR1 DSI Host Timeout Counter Configuration Register 1 **/
#define DSI_DSI_TCCR1			MMIO32(DSI_BASE + 0x7c)
/** DSI_DSI_TCCR2 DSI Host Timeout Counter Configuration Register 2 **/
#define DSI_DSI_TCCR2			MMIO32(DSI_BASE + 0x80)
/** DSI_DSI_TCCR3 DSI Host Timeout Counter Configuration Register 3 **/
#define DSI_DSI_TCCR3			MMIO32(DSI_BASE + 0x84)
/** DSI_DSI_TCCR4 DSI Host Timeout Counter Configuration Register 4 **/
#define DSI_DSI_TCCR4			MMIO32(DSI_BASE + 0x88)
/** DSI_DSI_TCCR5 DSI Host Timeout Counter Configuration Register 5 **/
#define DSI_DSI_TCCR5			MMIO32(DSI_BASE + 0x8c)
/** DSI_DSI_CLCR DSI Host Clock Lane Configuration Register **/
#define DSI_DSI_CLCR			MMIO32(DSI_BASE + 0x94)
/** DSI_DSI_CLTCR DSI Host Clock Lane Timer Configuration Register **/
#define DSI_DSI_CLTCR			MMIO32(DSI_BASE + 0x98)
/** DSI_DSI_DLTCR DSI Host Data Lane Timer Configuration Register **/
#define DSI_DSI_DLTCR			MMIO32(DSI_BASE + 0x9c)
/** DSI_DSI_PCTLR DSI Host PHY Control Register **/
#define DSI_DSI_PCTLR			MMIO32(DSI_BASE + 0xa0)
/** DSI_DSI_PCONFR DSI Host PHY Configuration Register **/
#define DSI_DSI_PCONFR			MMIO32(DSI_BASE + 0xa4)
/** DSI_DSI_PUCR DSI Host PHY ULPS Control Register **/
#define DSI_DSI_PUCR			MMIO32(DSI_BASE + 0xa8)
/** DSI_DSI_PTTCR DSI Host PHY TX Triggers Configuration Register **/
#define DSI_DSI_PTTCR			MMIO32(DSI_BASE + 0xac)
/** DSI_DSI_PSR DSI Host PHY Status Register **/
#define DSI_DSI_PSR			MMIO32(DSI_BASE + 0xb0)
/** DSI_DSI_ISR0 DSI Host Interrupt & Status Register 0 **/
#define DSI_DSI_ISR0			MMIO32(DSI_BASE + 0xbc)
/** DSI_DSI_ISR1 DSI Host Interrupt & Status Register 1 **/
#define DSI_DSI_ISR1			MMIO32(DSI_BASE + 0xc0)
/** DSI_DSI_IER0 DSI Host Interrupt Enable Register 0 **/
#define DSI_DSI_IER0			MMIO32(DSI_BASE + 0xc4)
/** DSI_DSI_IER1 DSI Host Interrupt Enable Register 1 **/
#define DSI_DSI_IER1			MMIO32(DSI_BASE + 0xc8)
/** DSI_DSI_FIR0 DSI Host Force Interrupt Register 0 **/
#define DSI_DSI_FIR0			MMIO32(DSI_BASE + 0xd8)
/** DSI_DSI_FIR1 DSI Host Force Interrupt Register 1 **/
#define DSI_DSI_FIR1			MMIO32(DSI_BASE + 0xdc)
/** DSI_DSI_VSCR DSI Host Video Shadow Control Register **/
#define DSI_DSI_VSCR			MMIO32(DSI_BASE + 0x100)
/** DSI_DSI_LCVCIDR DSI Host LTDC Current VCID Register **/
#define DSI_DSI_LCVCIDR			MMIO32(DSI_BASE + 0x10c)
/** DSI_DSI_LCCCR DSI Host LTDC Current Color Coding Register **/
#define DSI_DSI_LCCCR			MMIO32(DSI_BASE + 0x110)
/** DSI_DSI_LPMCCR DSI Host Low-Power mode Current Configuration Register **/
#define DSI_DSI_LPMCCR			MMIO32(DSI_BASE + 0x118)
/** DSI_DSI_VMCCR DSI Host Video mode Current Configuration Register **/
#define DSI_DSI_VMCCR			MMIO32(DSI_BASE + 0x138)
/** DSI_DSI_VPCCR DSI Host Video Packet Current Configuration Register **/
#define DSI_DSI_VPCCR			MMIO32(DSI_BASE + 0x13c)
/** DSI_DSI_VCCCR DSI Host Video Chunks Current Configuration Register **/
#define DSI_DSI_VCCCR			MMIO32(DSI_BASE + 0x140)
/** DSI_DSI_VNPCCR DSI Host Video Null Packet Current Configuration Register **/
#define DSI_DSI_VNPCCR			MMIO32(DSI_BASE + 0x144)
/** DSI_DSI_VHSACCR DSI Host Video HSA Current Configuration Register **/
#define DSI_DSI_VHSACCR			MMIO32(DSI_BASE + 0x148)
/** DSI_DSI_VHBPCCR DSI Host Video HBP Current Configuration Register **/
#define DSI_DSI_VHBPCCR			MMIO32(DSI_BASE + 0x14c)
/** DSI_DSI_VLCCR DSI Host Video Line Current Configuration Register **/
#define DSI_DSI_VLCCR			MMIO32(DSI_BASE + 0x150)
/** DSI_DSI_VVSACCR DSI Host Video VSA Current Configuration Register **/
#define DSI_DSI_VVSACCR			MMIO32(DSI_BASE + 0x154)
/** DSI_DSI_VVBPCCR DSI Host Video VBP Current Configuration Register **/
#define DSI_DSI_VVBPCCR			MMIO32(DSI_BASE + 0x158)
/** DSI_DSI_VVFPCCR DSI Host Video VFP Current Configuration Register **/
#define DSI_DSI_VVFPCCR			MMIO32(DSI_BASE + 0x15c)
/** DSI_DSI_VVACCR DSI Host Video VA Current Configuration Register **/
#define DSI_DSI_VVACCR			MMIO32(DSI_BASE + 0x160)
/** DSI_DSI_WCFGR DSI Wrapper Configuration Register **/
#define DSI_DSI_WCFGR			MMIO32(DSI_BASE + 0x400)
/** DSI_DSI_WCR DSI Wrapper Control Register **/
#define DSI_DSI_WCR			MMIO32(DSI_BASE + 0x404)
/** DSI_DSI_WIER DSI Wrapper Interrupt Enable Register **/
#define DSI_DSI_WIER			MMIO32(DSI_BASE + 0x408)
/** DSI_DSI_WISR DSI Wrapper Interrupt & Status Register **/
#define DSI_DSI_WISR			MMIO32(DSI_BASE + 0x40c)
/** DSI_DSI_WIFCR DSI Wrapper Interrupt Flag Clear Register **/
#define DSI_DSI_WIFCR			MMIO32(DSI_BASE + 0x410)
/** DSI_DSI_WPCR1 DSI Wrapper PHY Configuration Register 1 **/
#define DSI_DSI_WPCR1			MMIO32(DSI_BASE + 0x418)
/** DSI_DSI_WPCR2 DSI Wrapper PHY Configuration Register 2 **/
#define DSI_DSI_WPCR2			MMIO32(DSI_BASE + 0x41c)
/** DSI_DSI_WPCR3 DSI Wrapper PHY Configuration Register 3 **/
#define DSI_DSI_WPCR3			MMIO32(DSI_BASE + 0x420)
/** DSI_DSI_WPCR4 DSI_WPCR4 **/
#define DSI_DSI_WPCR4			MMIO32(DSI_BASE + 0x424)
/** DSI_DSI_WPCR5 DSI Wrapper PHY Configuration Register 5 **/
#define DSI_DSI_WPCR5			MMIO32(DSI_BASE + 0x428)
/** DSI_DSI_WRPCR DSI Wrapper Regulator and PLL Control Register **/
#define DSI_DSI_WRPCR			MMIO32(DSI_BASE + 0x430)

/**@}*/


/** @defgroup dsi_dsi_vr DSIVR DSI Host Version Register
@{*/


#define DSI_DSI_VR_VERSION_SHIFT		0
#define DSI_DSI_VR_VERSION_MASK		0xffffffff
/** @defgroup dsi_dsi_vr_version VERSION Version of the DSI Host
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_cr DSICR DSI Host Control Register
@{*/

/** DSI_DSI_CR_EN Enable **/
#define DSI_DSI_CR_EN		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_ccr DSICCR DSI HOST Clock Control Register
@{*/


