grevaillot/svd_tools/headers/STM32F7x7/dsi.h
#define DSI_DSI_CCR_TOCKDIV_SHIFT		8
#define DSI_DSI_CCR_TOCKDIV_MASK		0xff
/** @defgroup dsi_dsi_ccr_tockdiv TOCKDIV Timeout Clock Division
@{*/
/**@}*/


#define DSI_DSI_CCR_TXECKDIV_SHIFT		0
#define DSI_DSI_CCR_TXECKDIV_MASK		0xff
/** @defgroup dsi_dsi_ccr_txeckdiv TXECKDIV TX Escape Clock Division
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_lvcidr DSILVCIDR DSI Host LTDC VCID Register
@{*/


#define DSI_DSI_LVCIDR_VCID_SHIFT		0
#define DSI_DSI_LVCIDR_VCID_MASK		0x03
/** @defgroup dsi_dsi_lvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_lcolcr DSILCOLCR DSI Host LTDC Color Coding Register
@{*/

/** DSI_DSI_LCOLCR_LPE Loosely Packet Enable **/
#define DSI_DSI_LCOLCR_LPE		(1 << 8)

#define DSI_DSI_LCOLCR_COLC_SHIFT		0
#define DSI_DSI_LCOLCR_COLC_MASK		0x0f
/** @defgroup dsi_dsi_lcolcr_colc COLC Color Coding
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_lpcr DSILPCR DSI Host LTDC Polarity Configuration Register
@{*/

/** DSI_DSI_LPCR_HSP HSYNC Polarity **/
#define DSI_DSI_LPCR_HSP		(1 << 2)
/** DSI_DSI_LPCR_VSP VSYNC Polarity **/
#define DSI_DSI_LPCR_VSP		(1 << 1)
/** DSI_DSI_LPCR_DEP Data Enable Polarity **/
#define DSI_DSI_LPCR_DEP		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_lpmcr DSILPMCR DSI Host Low-Power mode Configuration Register
@{*/


#define DSI_DSI_LPMCR_LPSIZE_SHIFT		16
#define DSI_DSI_LPMCR_LPSIZE_MASK		0xff
/** @defgroup dsi_dsi_lpmcr_lpsize LPSIZE Largest Packet Size
@{*/
/**@}*/


#define DSI_DSI_LPMCR_VLPSIZE_SHIFT		0
#define DSI_DSI_LPMCR_VLPSIZE_MASK		0xff
/** @defgroup dsi_dsi_lpmcr_vlpsize VLPSIZE VACT Largest Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_pcr DSIPCR DSI Host Protocol Configuration Register
@{*/

/** DSI_DSI_PCR_CRCRXE CRC Reception Enable **/
#define DSI_DSI_PCR_CRCRXE		(1 << 4)
/** DSI_DSI_PCR_ECCRXE ECC Reception Enable **/
#define DSI_DSI_PCR_ECCRXE		(1 << 3)
/** DSI_DSI_PCR_BTAE Bus Turn Around Enable **/
#define DSI_DSI_PCR_BTAE		(1 << 2)
/** DSI_DSI_PCR_ETRXE EoTp Reception Enable **/
#define DSI_DSI_PCR_ETRXE		(1 << 1)
/** DSI_DSI_PCR_ETTXE EoTp Transmission Enable **/
#define DSI_DSI_PCR_ETTXE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_gvcidr DSIGVCIDR DSI Host Generic VCID Register
@{*/


#define DSI_DSI_GVCIDR_VCID_SHIFT		0
#define DSI_DSI_GVCIDR_VCID_MASK		0x03
/** @defgroup dsi_dsi_gvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_mcr DSIMCR DSI Host mode Configuration Register
@{*/

/** DSI_DSI_MCR_CMDM Command mode **/
#define DSI_DSI_MCR_CMDM		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_vmcr DSIVMCR DSI Host Video mode Configuration Register
@{*/

/** DSI_DSI_VMCR_PGO Pattern Generator Orientation **/
#define DSI_DSI_VMCR_PGO		(1 << 24)
/** DSI_DSI_VMCR_PGM Pattern Generator mode **/
#define DSI_DSI_VMCR_PGM		(1 << 20)
/** DSI_DSI_VMCR_PGE Pattern Generator Enable **/
#define DSI_DSI_VMCR_PGE		(1 << 16)
/** DSI_DSI_VMCR_LPCE Low-Power Command Enable **/
#define DSI_DSI_VMCR_LPCE		(1 << 15)
/** DSI_DSI_VMCR_FBTAAE Frame Bus-Turn-Around Acknowledge Enable **/
#define DSI_DSI_VMCR_FBTAAE		(1 << 14)
/** DSI_DSI_VMCR_LPHFPE Low-Power Horizontal Front-Porch Enable **/
#define DSI_DSI_VMCR_LPHFPE		(1 << 13)
/** DSI_DSI_VMCR_LPHBPE Low-Power Horizontal Back-Porch Enable **/
#define DSI_DSI_VMCR_LPHBPE		(1 << 12)
/** DSI_DSI_VMCR_LPVAE Low-Power Vertical Active Enable **/
#define DSI_DSI_VMCR_LPVAE		(1 << 11)
/** DSI_DSI_VMCR_LPVFPE Low-power Vertical Front-porch Enable **/
#define DSI_DSI_VMCR_LPVFPE		(1 << 10)
/** DSI_DSI_VMCR_LPVBPE Low-power Vertical Back-Porch Enable **/
#define DSI_DSI_VMCR_LPVBPE		(1 << 9)
/** DSI_DSI_VMCR_LPVSAE Low-Power Vertical Sync Active Enable **/
#define DSI_DSI_VMCR_LPVSAE		(1 << 8)

#define DSI_DSI_VMCR_VMT_SHIFT		0
#define DSI_DSI_VMCR_VMT_MASK		0x03
/** @defgroup dsi_dsi_vmcr_vmt VMT Video mode Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vpcr DSIVPCR DSI Host Video Packet Configuration Register
@{*/


#define DSI_DSI_VPCR_VPSIZE_SHIFT		0
#define DSI_DSI_VPCR_VPSIZE_MASK		0x3fff
/** @defgroup dsi_dsi_vpcr_vpsize VPSIZE Video Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vccr DSIVCCR DSI Host Video Chunks Configuration Register
@{*/


#define DSI_DSI_VCCR_NUMC_SHIFT		0
#define DSI_DSI_VCCR_NUMC_MASK		0x1fff
/** @defgroup dsi_dsi_vccr_numc NUMC Number of Chunks
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vnpcr DSIVNPCR DSI Host Video Null Packet Configuration Register
@{*/


#define DSI_DSI_VNPCR_NPSIZE_SHIFT		0
#define DSI_DSI_VNPCR_NPSIZE_MASK		0x1fff
/** @defgroup dsi_dsi_vnpcr_npsize NPSIZE Null Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vhsacr DSIVHSACR DSI Host Video HSA Configuration Register
@{*/


#define DSI_DSI_VHSACR_HSA_SHIFT		0
#define DSI_DSI_VHSACR_HSA_MASK		0xfff
/** @defgroup dsi_dsi_vhsacr_hsa HSA Horizontal Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vhbpcr DSIVHBPCR DSI Host Video HBP Configuration Register
@{*/


#define DSI_DSI_VHBPCR_HBP_SHIFT		0
#define DSI_DSI_VHBPCR_HBP_MASK		0xfff
/** @defgroup dsi_dsi_vhbpcr_hbp HBP Horizontal Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vlcr DSIVLCR DSI Host Video Line Configuration Register
@{*/


#define DSI_DSI_VLCR_HLINE_SHIFT		0
#define DSI_DSI_VLCR_HLINE_MASK		0x7fff
/** @defgroup dsi_dsi_vlcr_hline HLINE Horizontal Line duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvsacr DSIVVSACR DSI Host Video VSA Configuration Register
@{*/


#define DSI_DSI_VVSACR_VSA_SHIFT		0
#define DSI_DSI_VVSACR_VSA_MASK		0x3ff
/** @defgroup dsi_dsi_vvsacr_vsa VSA Vertical Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvbpcr DSIVVBPCR DSI Host Video VBP Configuration Register
@{*/


#define DSI_DSI_VVBPCR_VBP_SHIFT		0
#define DSI_DSI_VVBPCR_VBP_MASK		0x3ff
/** @defgroup dsi_dsi_vvbpcr_vbp VBP Vertical Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvfpcr DSIVVFPCR DSI Host Video VFP Configuration Register
@{*/


#define DSI_DSI_VVFPCR_VFP_SHIFT		0
#define DSI_DSI_VVFPCR_VFP_MASK		0x3ff
/** @defgroup dsi_dsi_vvfpcr_vfp VFP Vertical Front-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvacr DSIVVACR DSI Host Video VA Configuration Register
@{*/


#define DSI_DSI_VVACR_VA_SHIFT		0
#define DSI_DSI_VVACR_VA_MASK		0x3fff
/** @defgroup dsi_dsi_vvacr_va VA Vertical Active duration
@{*/
/**@}*/


/**@}*/

