grevaillot/svd_tools/headers/STM32F7x7/dsi.h
/** @defgroup dsi_dsi_lccr DSILCCR DSI Host LTDC Command Configuration Register
@{*/


#define DSI_DSI_LCCR_CMDSIZE_SHIFT		0
#define DSI_DSI_LCCR_CMDSIZE_MASK		0xffff
/** @defgroup dsi_dsi_lccr_cmdsize CMDSIZE Command Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_cmcr DSICMCR DSI Host Command mode Configuration Register
@{*/

/** DSI_DSI_CMCR_MRDPS Maximum Read Packet Size **/
#define DSI_DSI_CMCR_MRDPS		(1 << 24)
/** DSI_DSI_CMCR_DLWTX DCS Long Write Transmission **/
#define DSI_DSI_CMCR_DLWTX		(1 << 19)
/** DSI_DSI_CMCR_DSR0TX DCS Short Read Zero parameter Transmission **/
#define DSI_DSI_CMCR_DSR0TX		(1 << 18)
/** DSI_DSI_CMCR_DSW1TX DCS Short Read One parameter Transmission **/
#define DSI_DSI_CMCR_DSW1TX		(1 << 17)
/** DSI_DSI_CMCR_DSW0TX DCS Short Write Zero parameter Transmission **/
#define DSI_DSI_CMCR_DSW0TX		(1 << 16)
/** DSI_DSI_CMCR_GLWTX Generic Long Write Transmission **/
#define DSI_DSI_CMCR_GLWTX		(1 << 14)
/** DSI_DSI_CMCR_GSR2TX Generic Short Read Two parameters Transmission **/
#define DSI_DSI_CMCR_GSR2TX		(1 << 13)
/** DSI_DSI_CMCR_GSR1TX Generic Short Read One parameters Transmission **/
#define DSI_DSI_CMCR_GSR1TX		(1 << 12)
/** DSI_DSI_CMCR_GSR0TX Generic Short Read Zero parameters Transmission **/
#define DSI_DSI_CMCR_GSR0TX		(1 << 11)
/** DSI_DSI_CMCR_GSW2TX Generic Short Write Two parameters Transmission **/
#define DSI_DSI_CMCR_GSW2TX		(1 << 10)
/** DSI_DSI_CMCR_GSW1TX Generic Short Write One parameters Transmission **/
#define DSI_DSI_CMCR_GSW1TX		(1 << 9)
/** DSI_DSI_CMCR_GSW0TX Generic Short Write Zero parameters Transmission **/
#define DSI_DSI_CMCR_GSW0TX		(1 << 8)
/** DSI_DSI_CMCR_ARE Acknowledge Request Enable **/
#define DSI_DSI_CMCR_ARE		(1 << 1)
/** DSI_DSI_CMCR_TEARE Tearing Effect Acknowledge Request Enable **/
#define DSI_DSI_CMCR_TEARE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_ghcr DSIGHCR DSI Host Generic Header Configuration Register
@{*/


#define DSI_DSI_GHCR_WCMSB_SHIFT		16
#define DSI_DSI_GHCR_WCMSB_MASK		0xff
/** @defgroup dsi_dsi_ghcr_wcmsb WCMSB WordCount MSB
@{*/
/**@}*/


#define DSI_DSI_GHCR_WCLSB_SHIFT		8
#define DSI_DSI_GHCR_WCLSB_MASK		0xff
/** @defgroup dsi_dsi_ghcr_wclsb WCLSB WordCount LSB
@{*/
/**@}*/


#define DSI_DSI_GHCR_VCID_SHIFT		6
#define DSI_DSI_GHCR_VCID_MASK		0x03
/** @defgroup dsi_dsi_ghcr_vcid VCID Channel
@{*/
/**@}*/


#define DSI_DSI_GHCR_DT_SHIFT		0
#define DSI_DSI_GHCR_DT_MASK		0x3f
/** @defgroup dsi_dsi_ghcr_dt DT Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_gpdr DSIGPDR DSI Host Generic Payload Data Register
@{*/


#define DSI_DSI_GPDR_DATA4_SHIFT		24
#define DSI_DSI_GPDR_DATA4_MASK		0xff
/** @defgroup dsi_dsi_gpdr_data4 DATA4 Payload Byte 4
@{*/
/**@}*/


#define DSI_DSI_GPDR_DATA3_SHIFT		16
#define DSI_DSI_GPDR_DATA3_MASK		0xff
/** @defgroup dsi_dsi_gpdr_data3 DATA3 Payload Byte 3
@{*/
/**@}*/


#define DSI_DSI_GPDR_DATA2_SHIFT		8
#define DSI_DSI_GPDR_DATA2_MASK		0xff
/** @defgroup dsi_dsi_gpdr_data2 DATA2 Payload Byte 2
@{*/
/**@}*/


#define DSI_DSI_GPDR_DATA1_SHIFT		0
#define DSI_DSI_GPDR_DATA1_MASK		0xff
/** @defgroup dsi_dsi_gpdr_data1 DATA1 Payload Byte 1
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_gpsr DSIGPSR DSI Host Generic Packet Status Register
@{*/

/** DSI_DSI_GPSR_RCB Read Command Busy **/
#define DSI_DSI_GPSR_RCB		(1 << 6)
/** DSI_DSI_GPSR_PRDFF Payload Read FIFO Full **/
#define DSI_DSI_GPSR_PRDFF		(1 << 5)
/** DSI_DSI_GPSR_PRDFE Payload Read FIFO Empty **/
#define DSI_DSI_GPSR_PRDFE		(1 << 4)
/** DSI_DSI_GPSR_PWRFF Payload Write FIFO Full **/
#define DSI_DSI_GPSR_PWRFF		(1 << 3)
/** DSI_DSI_GPSR_PWRFE Payload Write FIFO Empty **/
#define DSI_DSI_GPSR_PWRFE		(1 << 2)
/** DSI_DSI_GPSR_CMDFF Command FIFO Full **/
#define DSI_DSI_GPSR_CMDFF		(1 << 1)
/** DSI_DSI_GPSR_CMDFE Command FIFO Empty **/
#define DSI_DSI_GPSR_CMDFE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_tccr0 DSITCCR0 DSI Host Timeout Counter Configuration Register 0
@{*/


#define DSI_DSI_TCCR0_HSTX_TOCNT_SHIFT		16
#define DSI_DSI_TCCR0_HSTX_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr0_hstx_tocnt HSTXTOCNT High-Speed Transmission Timeout Counter
@{*/
/**@}*/


#define DSI_DSI_TCCR0_LPRX_TOCNT_SHIFT		0
#define DSI_DSI_TCCR0_LPRX_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr0_lprx_tocnt LPRXTOCNT Low-power Reception Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_tccr1 DSITCCR1 DSI Host Timeout Counter Configuration Register 1
@{*/


#define DSI_DSI_TCCR1_HSRD_TOCNT_SHIFT		0
#define DSI_DSI_TCCR1_HSRD_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr1_hsrd_tocnt HSRDTOCNT High-Speed Read Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_tccr2 DSITCCR2 DSI Host Timeout Counter Configuration Register 2
@{*/


#define DSI_DSI_TCCR2_LPRD_TOCNT_SHIFT		0
#define DSI_DSI_TCCR2_LPRD_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr2_lprd_tocnt LPRDTOCNT Low-Power Read Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_tccr3 DSITCCR3 DSI Host Timeout Counter Configuration Register 3
@{*/

/** DSI_DSI_TCCR3_PM Presp mode **/
#define DSI_DSI_TCCR3_PM		(1 << 24)

#define DSI_DSI_TCCR3_HSWR_TOCNT_SHIFT		0
#define DSI_DSI_TCCR3_HSWR_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr3_hswr_tocnt HSWRTOCNT High-Speed Write Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_tccr4 DSITCCR4 DSI Host Timeout Counter Configuration Register 4
@{*/


#define DSI_DSI_TCCR4_LSWR_TOCNT_SHIFT		0
#define DSI_DSI_TCCR4_LSWR_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr4_lswr_tocnt LSWRTOCNT Low-Power Write Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_tccr5 DSITCCR5 DSI Host Timeout Counter Configuration Register 5
@{*/


#define DSI_DSI_TCCR5_BTA_TOCNT_SHIFT		0
#define DSI_DSI_TCCR5_BTA_TOCNT_MASK		0xffff
/** @defgroup dsi_dsi_tccr5_bta_tocnt BTATOCNT Bus-Turn-Around Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_clcr DSICLCR DSI Host Clock Lane Configuration Register
@{*/

/** DSI_DSI_CLCR_ACR Automatic Clock lane Control **/
#define DSI_DSI_CLCR_ACR		(1 << 1)
/** DSI_DSI_CLCR_DPCC D-PHY Clock Control **/
#define DSI_DSI_CLCR_DPCC		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_cltcr DSICLTCR DSI Host Clock Lane Timer Configuration Register
@{*/


