grevaillot/svd_tools/headers/STM32F7x7/dsi.h
#define DSI_DSI_CLTCR_HS2LP_TIME_SHIFT		16
#define DSI_DSI_CLTCR_HS2LP_TIME_MASK		0x3ff
/** @defgroup dsi_dsi_cltcr_hs2lp_time HS2LPTIME High-Speed to Low-Power Time
@{*/
/**@}*/


#define DSI_DSI_CLTCR_LP2HS_TIME_SHIFT		0
#define DSI_DSI_CLTCR_LP2HS_TIME_MASK		0x3ff
/** @defgroup dsi_dsi_cltcr_lp2hs_time LP2HSTIME Low-Power to High-Speed Time
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_dltcr DSIDLTCR DSI Host Data Lane Timer Configuration Register
@{*/


#define DSI_DSI_DLTCR_HS2LP_TIME_SHIFT		24
#define DSI_DSI_DLTCR_HS2LP_TIME_MASK		0xff
/** @defgroup dsi_dsi_dltcr_hs2lp_time HS2LPTIME High-Speed To Low-Power Time
@{*/
/**@}*/


#define DSI_DSI_DLTCR_LP2HS_TIME_SHIFT		16
#define DSI_DSI_DLTCR_LP2HS_TIME_MASK		0xff
/** @defgroup dsi_dsi_dltcr_lp2hs_time LP2HSTIME Low-Power To High-Speed Time
@{*/
/**@}*/


#define DSI_DSI_DLTCR_MRD_TIME_SHIFT		0
#define DSI_DSI_DLTCR_MRD_TIME_MASK		0x7fff
/** @defgroup dsi_dsi_dltcr_mrd_time MRDTIME Maximum Read Time
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_pctlr DSIPCTLR DSI Host PHY Control Register
@{*/

/** DSI_DSI_PCTLR_CKE Clock Enable **/
#define DSI_DSI_PCTLR_CKE		(1 << 2)
/** DSI_DSI_PCTLR_DEN Digital Enable **/
#define DSI_DSI_PCTLR_DEN		(1 << 1)

/**@}*/

/** @defgroup dsi_dsi_pconfr DSIPCONFR DSI Host PHY Configuration Register
@{*/


#define DSI_DSI_PCONFR_SW_TIME_SHIFT		8
#define DSI_DSI_PCONFR_SW_TIME_MASK		0xff
/** @defgroup dsi_dsi_pconfr_sw_time SWTIME Stop Wait Time
@{*/
/**@}*/


#define DSI_DSI_PCONFR_NL_SHIFT		0
#define DSI_DSI_PCONFR_NL_MASK		0x03
/** @defgroup dsi_dsi_pconfr_nl NL Number of Lanes
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_pucr DSIPUCR DSI Host PHY ULPS Control Register
@{*/

/** DSI_DSI_PUCR_UEDL ULPS Exit on Data Lane **/
#define DSI_DSI_PUCR_UEDL		(1 << 3)
/** DSI_DSI_PUCR_URDL ULPS Request on Data Lane **/
#define DSI_DSI_PUCR_URDL		(1 << 2)
/** DSI_DSI_PUCR_UECL ULPS Exit on Clock Lane **/
#define DSI_DSI_PUCR_UECL		(1 << 1)
/** DSI_DSI_PUCR_URCL ULPS Request on Clock Lane **/
#define DSI_DSI_PUCR_URCL		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_pttcr DSIPTTCR DSI Host PHY TX Triggers Configuration Register
@{*/


#define DSI_DSI_PTTCR_TX_TRIG_SHIFT		0
#define DSI_DSI_PTTCR_TX_TRIG_MASK		0x0f
/** @defgroup dsi_dsi_pttcr_tx_trig TXTRIG Transmission Trigger
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_psr DSIPSR DSI Host PHY Status Register
@{*/

/** DSI_DSI_PSR_UAN1 ULPS Active Not lane 1 **/
#define DSI_DSI_PSR_UAN1		(1 << 8)
/** DSI_DSI_PSR_PSS1 PHY Stop State lane 1 **/
#define DSI_DSI_PSR_PSS1		(1 << 7)
/** DSI_DSI_PSR_RUE0 RX ULPS Escape lane 0 **/
#define DSI_DSI_PSR_RUE0		(1 << 6)
/** DSI_DSI_PSR_UAN0 ULPS Active Not lane 1 **/
#define DSI_DSI_PSR_UAN0		(1 << 5)
/** DSI_DSI_PSR_PSS0 PHY Stop State lane 0 **/
#define DSI_DSI_PSR_PSS0		(1 << 4)
/** DSI_DSI_PSR_UANC ULPS Active Not Clock lane **/
#define DSI_DSI_PSR_UANC		(1 << 3)
/** DSI_DSI_PSR_PSSC PHY Stop State Clock lane **/
#define DSI_DSI_PSR_PSSC		(1 << 2)
/** DSI_DSI_PSR_PD PHY Direction **/
#define DSI_DSI_PSR_PD		(1 << 1)

/**@}*/

/** @defgroup dsi_dsi_isr0 DSIISR0 DSI Host Interrupt & Status Register 0
@{*/

/** DSI_DSI_ISR0_PE4 PHY Error 4 **/
#define DSI_DSI_ISR0_PE4		(1 << 20)
/** DSI_DSI_ISR0_PE3 PHY Error 3 **/
#define DSI_DSI_ISR0_PE3		(1 << 19)
/** DSI_DSI_ISR0_PE2 PHY Error 2 **/
#define DSI_DSI_ISR0_PE2		(1 << 18)
/** DSI_DSI_ISR0_PE1 PHY Error 1 **/
#define DSI_DSI_ISR0_PE1		(1 << 17)
/** DSI_DSI_ISR0_PE0 PHY Error 0 **/
#define DSI_DSI_ISR0_PE0		(1 << 16)
/** DSI_DSI_ISR0_AE15 Acknowledge Error 15 **/
#define DSI_DSI_ISR0_AE15		(1 << 15)
/** DSI_DSI_ISR0_AE14 Acknowledge Error 14 **/
#define DSI_DSI_ISR0_AE14		(1 << 14)
/** DSI_DSI_ISR0_AE13 Acknowledge Error 13 **/
#define DSI_DSI_ISR0_AE13		(1 << 13)
/** DSI_DSI_ISR0_AE12 Acknowledge Error 12 **/
#define DSI_DSI_ISR0_AE12		(1 << 12)
/** DSI_DSI_ISR0_AE11 Acknowledge Error 11 **/
#define DSI_DSI_ISR0_AE11		(1 << 11)
/** DSI_DSI_ISR0_AE10 Acknowledge Error 10 **/
#define DSI_DSI_ISR0_AE10		(1 << 10)
/** DSI_DSI_ISR0_AE9 Acknowledge Error 9 **/
#define DSI_DSI_ISR0_AE9		(1 << 9)
/** DSI_DSI_ISR0_AE8 Acknowledge Error 8 **/
#define DSI_DSI_ISR0_AE8		(1 << 8)
/** DSI_DSI_ISR0_AE7 Acknowledge Error 7 **/
#define DSI_DSI_ISR0_AE7		(1 << 7)
/** DSI_DSI_ISR0_AE6 Acknowledge Error 6 **/
#define DSI_DSI_ISR0_AE6		(1 << 6)
/** DSI_DSI_ISR0_AE5 Acknowledge Error 5 **/
#define DSI_DSI_ISR0_AE5		(1 << 5)
/** DSI_DSI_ISR0_AE4 Acknowledge Error 4 **/
#define DSI_DSI_ISR0_AE4		(1 << 4)
/** DSI_DSI_ISR0_AE3 Acknowledge Error 3 **/
#define DSI_DSI_ISR0_AE3		(1 << 3)
/** DSI_DSI_ISR0_AE2 Acknowledge Error 2 **/
#define DSI_DSI_ISR0_AE2		(1 << 2)
/** DSI_DSI_ISR0_AE1 Acknowledge Error 1 **/
#define DSI_DSI_ISR0_AE1		(1 << 1)
/** DSI_DSI_ISR0_AE0 Acknowledge Error 0 **/
#define DSI_DSI_ISR0_AE0		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_isr1 DSIISR1 DSI Host Interrupt & Status Register 1
@{*/

/** DSI_DSI_ISR1_GPRXE Generic Payload Receive Error **/
#define DSI_DSI_ISR1_GPRXE		(1 << 12)
/** DSI_DSI_ISR1_GPRDE Generic Payload Read Error **/
#define DSI_DSI_ISR1_GPRDE		(1 << 11)
/** DSI_DSI_ISR1_GPTXE Generic Payload Transmit Error **/
#define DSI_DSI_ISR1_GPTXE		(1 << 10)
/** DSI_DSI_ISR1_GPWRE Generic Payload Write Error **/
#define DSI_DSI_ISR1_GPWRE		(1 << 9)
/** DSI_DSI_ISR1_GCWRE Generic Command Write Error **/
#define DSI_DSI_ISR1_GCWRE		(1 << 8)
/** DSI_DSI_ISR1_LPWRE LTDC Payload Write Error **/
#define DSI_DSI_ISR1_LPWRE		(1 << 7)
/** DSI_DSI_ISR1_EOTPE EoTp Error **/
#define DSI_DSI_ISR1_EOTPE		(1 << 6)
/** DSI_DSI_ISR1_PSE Packet Size Error **/
#define DSI_DSI_ISR1_PSE		(1 << 5)
/** DSI_DSI_ISR1_CRCE CRC Error **/
#define DSI_DSI_ISR1_CRCE		(1 << 4)
/** DSI_DSI_ISR1_ECCME ECC Multi-bit Error **/
#define DSI_DSI_ISR1_ECCME		(1 << 3)
/** DSI_DSI_ISR1_ECCSE ECC Single-bit Error **/
#define DSI_DSI_ISR1_ECCSE		(1 << 2)
/** DSI_DSI_ISR1_TOLPRX Timeout Low-Power Reception **/
#define DSI_DSI_ISR1_TOLPRX		(1 << 1)
/** DSI_DSI_ISR1_TOHSTX Timeout High-Speed Transmission **/
#define DSI_DSI_ISR1_TOHSTX		(1 << 0)

/**@}*/

