grevaillot/svd_tools/headers/STM32F7x7/dsi.h
/** DSI_DSI_VSCR_UR Update Register **/
#define DSI_DSI_VSCR_UR		(1 << 8)
/** DSI_DSI_VSCR_EN Enable **/
#define DSI_DSI_VSCR_EN		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_lcvcidr DSILCVCIDR DSI Host LTDC Current VCID Register
@{*/


#define DSI_DSI_LCVCIDR_VCID_SHIFT		0
#define DSI_DSI_LCVCIDR_VCID_MASK		0x03
/** @defgroup dsi_dsi_lcvcidr_vcid VCID Virtual Channel ID
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_lcccr DSILCCCR DSI Host LTDC Current Color Coding Register
@{*/

/** DSI_DSI_LCCCR_LPE Loosely Packed Enable **/
#define DSI_DSI_LCCCR_LPE		(1 << 8)

#define DSI_DSI_LCCCR_COLC_SHIFT		0
#define DSI_DSI_LCCCR_COLC_MASK		0x0f
/** @defgroup dsi_dsi_lcccr_colc COLC Color Coding
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_lpmccr DSILPMCCR DSI Host Low-Power mode Current Configuration Register
@{*/


#define DSI_DSI_LPMCCR_LPSIZE_SHIFT		16
#define DSI_DSI_LPMCCR_LPSIZE_MASK		0xff
/** @defgroup dsi_dsi_lpmccr_lpsize LPSIZE Largest Packet Size
@{*/
/**@}*/


#define DSI_DSI_LPMCCR_VLPSIZE_SHIFT		0
#define DSI_DSI_LPMCCR_VLPSIZE_MASK		0xff
/** @defgroup dsi_dsi_lpmccr_vlpsize VLPSIZE VACT Largest Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vmccr DSIVMCCR DSI Host Video mode Current Configuration Register
@{*/

/** DSI_DSI_VMCCR_LPCE Low-Power Command Enable **/
#define DSI_DSI_VMCCR_LPCE		(1 << 9)
/** DSI_DSI_VMCCR_FBTAAE Frame BTA Acknowledge Enable **/
#define DSI_DSI_VMCCR_FBTAAE		(1 << 8)
/** DSI_DSI_VMCCR_LPHFE Low-Power Horizontal Front-Porch Enable **/
#define DSI_DSI_VMCCR_LPHFE		(1 << 7)
/** DSI_DSI_VMCCR_LPHBPE Low-power Horizontal Back-Porch Enable **/
#define DSI_DSI_VMCCR_LPHBPE		(1 << 6)
/** DSI_DSI_VMCCR_LPVAE Low-Power Vertical Active Enable **/
#define DSI_DSI_VMCCR_LPVAE		(1 << 5)
/** DSI_DSI_VMCCR_LPVFPE Low-power Vertical Front-Porch Enable **/
#define DSI_DSI_VMCCR_LPVFPE		(1 << 4)
/** DSI_DSI_VMCCR_LPVBPE Low-power Vertical Back-Porch Enable **/
#define DSI_DSI_VMCCR_LPVBPE		(1 << 3)
/** DSI_DSI_VMCCR_LPVSAE Low-Power Vertical Sync time Enable **/
#define DSI_DSI_VMCCR_LPVSAE		(1 << 2)

#define DSI_DSI_VMCCR_VMT_SHIFT		0
#define DSI_DSI_VMCCR_VMT_MASK		0x03
/** @defgroup dsi_dsi_vmccr_vmt VMT Video mode Type
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vpccr DSIVPCCR DSI Host Video Packet Current Configuration Register
@{*/


#define DSI_DSI_VPCCR_VPSIZE_SHIFT		0
#define DSI_DSI_VPCCR_VPSIZE_MASK		0x3fff
/** @defgroup dsi_dsi_vpccr_vpsize VPSIZE Video Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vcccr DSIVCCCR DSI Host Video Chunks Current Configuration Register
@{*/


#define DSI_DSI_VCCCR_NUMC_SHIFT		0
#define DSI_DSI_VCCCR_NUMC_MASK		0x1fff
/** @defgroup dsi_dsi_vcccr_numc NUMC Number of Chunks
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vnpccr DSIVNPCCR DSI Host Video Null Packet Current Configuration Register
@{*/


#define DSI_DSI_VNPCCR_NPSIZE_SHIFT		0
#define DSI_DSI_VNPCCR_NPSIZE_MASK		0x1fff
/** @defgroup dsi_dsi_vnpccr_npsize NPSIZE Null Packet Size
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vhsaccr DSIVHSACCR DSI Host Video HSA Current Configuration Register
@{*/


#define DSI_DSI_VHSACCR_HSA_SHIFT		0
#define DSI_DSI_VHSACCR_HSA_MASK		0xfff
/** @defgroup dsi_dsi_vhsaccr_hsa HSA Horizontal Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vhbpccr DSIVHBPCCR DSI Host Video HBP Current Configuration Register
@{*/


#define DSI_DSI_VHBPCCR_HBP_SHIFT		0
#define DSI_DSI_VHBPCCR_HBP_MASK		0xfff
/** @defgroup dsi_dsi_vhbpccr_hbp HBP Horizontal Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vlccr DSIVLCCR DSI Host Video Line Current Configuration Register
@{*/


#define DSI_DSI_VLCCR_HLINE_SHIFT		0
#define DSI_DSI_VLCCR_HLINE_MASK		0x7fff
/** @defgroup dsi_dsi_vlccr_hline HLINE Horizontal Line duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvsaccr DSIVVSACCR DSI Host Video VSA Current Configuration Register
@{*/


#define DSI_DSI_VVSACCR_VSA_SHIFT		0
#define DSI_DSI_VVSACCR_VSA_MASK		0x3ff
/** @defgroup dsi_dsi_vvsaccr_vsa VSA Vertical Synchronism Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvbpccr DSIVVBPCCR DSI Host Video VBP Current Configuration Register
@{*/


#define DSI_DSI_VVBPCCR_VBP_SHIFT		0
#define DSI_DSI_VVBPCCR_VBP_MASK		0x3ff
/** @defgroup dsi_dsi_vvbpccr_vbp VBP Vertical Back-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvfpccr DSIVVFPCCR DSI Host Video VFP Current Configuration Register
@{*/


#define DSI_DSI_VVFPCCR_VFP_SHIFT		0
#define DSI_DSI_VVFPCCR_VFP_MASK		0x3ff
/** @defgroup dsi_dsi_vvfpccr_vfp VFP Vertical Front-Porch duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_vvaccr DSIVVACCR DSI Host Video VA Current Configuration Register
@{*/


#define DSI_DSI_VVACCR_VA_SHIFT		0
#define DSI_DSI_VVACCR_VA_MASK		0x3fff
/** @defgroup dsi_dsi_vvaccr_va VA Vertical Active duration
@{*/
/**@}*/


/**@}*/

/** @defgroup dsi_dsi_wcfgr DSIWCFGR DSI Wrapper Configuration Register
@{*/

/** DSI_DSI_WCFGR_VSPOL VSync Polarity **/
#define DSI_DSI_WCFGR_VSPOL		(1 << 7)
/** DSI_DSI_WCFGR_AR Automatic Refresh **/
#define DSI_DSI_WCFGR_AR		(1 << 6)
/** DSI_DSI_WCFGR_TEPOL TE Polarity **/
#define DSI_DSI_WCFGR_TEPOL		(1 << 5)
/** DSI_DSI_WCFGR_TESRC TE Source **/
#define DSI_DSI_WCFGR_TESRC		(1 << 4)

#define DSI_DSI_WCFGR_COLMUX_SHIFT		1
#define DSI_DSI_WCFGR_COLMUX_MASK		0x07
/** @defgroup dsi_dsi_wcfgr_colmux COLMUX Color Multiplexing
@{*/
/**@}*/

/** DSI_DSI_WCFGR_DSIM DSI Mode **/
#define DSI_DSI_WCFGR_DSIM		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_wcr DSIWCR DSI Wrapper Control Register
@{*/

/** DSI_DSI_WCR_DSIEN DSI Enable **/
#define DSI_DSI_WCR_DSIEN		(1 << 3)
/** DSI_DSI_WCR_LTDCEN LTDC Enable **/
#define DSI_DSI_WCR_LTDCEN		(1 << 2)
/** DSI_DSI_WCR_SHTDN Shutdown **/
#define DSI_DSI_WCR_SHTDN		(1 << 1)
/** DSI_DSI_WCR_COLM Color Mode **/
#define DSI_DSI_WCR_COLM		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_wier DSIWIER DSI Wrapper Interrupt Enable Register
@{*/

/** DSI_DSI_WIER_RRIE Regulator Ready Interrupt Enable **/
#define DSI_DSI_WIER_RRIE		(1 << 13)
/** DSI_DSI_WIER_PLLUIE PLL Unlock Interrupt Enable **/
#define DSI_DSI_WIER_PLLUIE		(1 << 10)
/** DSI_DSI_WIER_PLLLIE PLL Lock Interrupt Enable **/
#define DSI_DSI_WIER_PLLLIE		(1 << 9)
/** DSI_DSI_WIER_ERIE End of Refresh Interrupt Enable **/
#define DSI_DSI_WIER_ERIE		(1 << 1)
/** DSI_DSI_WIER_TEIE Tearing Effect Interrupt Enable **/
#define DSI_DSI_WIER_TEIE		(1 << 0)

/**@}*/

/** @defgroup dsi_dsi_wisr DSIWISR DSI Wrapper Interrupt & Status Register
@{*/

